In [46]:
import pandas as pd
from collections import OrderedDict

In [47]:
friend_list1 = [
    ['name', ['A','B','C']],
    ['age', [20, 30, 40]],
    ['job', ['student','teacher','developer']]
]

friend_list2 = [
    ['A', 20, 'student'],
    ['B', 30, 'developer'],
    ['C', 40, 'teacher']
]

friend_dict_list = [
    {'name' : 'A', 'age' : 20, 'job' : 'student'},
    {'name' : 'B', 'age' : 30, 'job' : 'developer'},
    {'name' : 'C', 'age' : 40, 'job' : 'teacher'}
]

friend_ordered_list = OrderedDict(
    [
        ('name', ['A', 'B', 'C']),
        ('age', [20, 30, 40]),
        ('job', ['student', 'teacher', 'developer'])
    ]
)


type(friend_dict_list)

list

In [13]:
df = pd.read_csv("data/friend_list_no_head.csv", header=None, names=['name','age','job'])
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [31]:
friends = [
    {'age':15, 'job':'student'},
    {'age':25, 'job':'developer'},
    {'age':30, 'job':'teacher'}
]

df = pd.DataFrame(data=friends,index=['John', 'Jenny', 'Nate'], columns=['age', 'jobs'])
df.head()

       age  jobs
John    15   NaN
Jenny   25   NaN
Nate    30   NaN

In [35]:
df.drop(['John', "Nate"]) # 없애고 싶은 정보 입력

       age  jobs
Jenny   25   NaN

In [41]:
df = pd.DataFrame(friend_dict_list, columns=['name','age','job'])
df

  name  age        job
0    A   20    student
1    B   30  developer
2    C   40    teacher

In [42]:
df[df.age>20]

  name  age        job
1    B   30  developer
2    C   40    teacher

In [45]:
df.drop('age', axis=1)

  name        job
0    A    student
1    B  developer
2    C    teacher